thinhvu-h/coolbrace/nrf52x_test/firmw/bluetooth/ble_app.c
#include "ble_app.h"
#include "gpio_app.h"
#include "battery_app.h"
#include "temperature_app.h"
#include "ble_cus.h"

#include "nrf_log.h"

static uint16_t          m_conn_handle = BLE_CONN_HANDLE_INVALID;         /**< Handle of the current connection. */
static bool              m_hts_meas_ind_conf_pending = true;              /**< Flag to keep track of when an indication confirmation is pending. */
static bool              m_bas_notif_enable = false;                       /**< Flag to keep track of when an notify is enable. */

BLE_CUS_DEF(m_cus);                                                                 /**< Custom Service instance. */
// BLE_LBS_DEF(m_lbs);                                                                 /**< LED Button Service instance. */
BLE_HTS_DEF(m_hts);                                                                 /**< Structure used to identify the health thermometer service. */
BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
NRF_BLE_GQ_DEF(m_ble_gatt_queue,                                                    /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_PERIPHERAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);

static ble_uuid_t m_adv_uuids[] =                                                   /**< Universally unique service identifiers. */
{
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
// void notification_timeout_handler(void * p_context)
// {
//     UNUSED_PARAMETER(p_context);
//     ret_code_t err_code;
    
//     // Increment the value of m_custom_value before nortifing it.
//     m_custom_value++;
    
//     err_code = ble_cus_custom_value_update(&m_cus, m_custom_value);
//     APP_ERROR_CHECK(err_code);
// }

/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    ret_code_t err_code;
    uint8_t  battery_level;
    uint16_t vbatt;              // Variable to hold voltage reading
    battery_voltage_get(&vbatt); // Get new battery voltage

    battery_level = battery_level_percent(vbatt);    //Transform the millivolts value into battery level percent.
    NRF_LOG_INFO("Battery level: %d", battery_level);
    if (m_bas_notif_enable) {
        err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_BUSY) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        )
        {
            NRF_LOG_INFO(" ... Sending => FAILED");
            APP_ERROR_HANDLER(err_code);
        } else {
            NRF_LOG_INFO(" ... Sending => SUCCESSED");
        }
    }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
void battery_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/**@brief Function for simulating and sending one Temperature Measurement.
 */
static void temperature_update(void)
{
    ble_hts_meas_t temperature_meas;
    ret_code_t     err_code;
    temperature_measurement(&temperature_meas);
    NRF_LOG_INFO("Temperature: %d", temperature_meas.temp_in_celcius.mantissa);
    if (!m_hts_meas_ind_conf_pending)
    {
        err_code = ble_hts_measurement_send(&m_hts, &temperature_meas);

        switch (err_code)
        {
            case NRF_SUCCESS:
                NRF_LOG_INFO(" ... Sending => SUCCESSED");
                // Measurement was successfully sent, wait for confirmation.
                m_hts_meas_ind_conf_pending = true;
                break;

            case NRF_ERROR_INVALID_STATE:
                NRF_LOG_INFO(" ... Sending => INVALID_STATE");
                // Ignore error.
                break;

            default:
                NRF_LOG_INFO(" ... Sending => FAILED");
                APP_ERROR_HANDLER(err_code);
                break;
        }
    }
}


/**@brief Function for handling the Temperature measurement timer timeout.
 *
 * @details This function will be called each time the temperature measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
void temperature_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    temperature_update();
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;
    bool       is_indication_enabled;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_CONN_SEC_SUCCEEDED:
            NRF_LOG_INFO("PM_EVT_CONN_SEC_SUCCEEDED");
            err_code = ble_hts_is_indication_enabled(&m_hts, &is_indication_enabled);
            APP_ERROR_CHECK(err_code);
            if (is_indication_enabled) {
                m_hts_meas_ind_conf_pending = false;
            }
            break;

